app/Controllers/Tweet.php

    public function __construct()
    {
        $this->categories = (new \Config\AdtConfig())->getCategories();
        $this->sess = session();
        $this->curUser = $this->sess->get('currentuser');

        $this->tweetMdl = new TweetModel();
        $userMdl = new \App\Models\UserModel();
        $this->profile = $userMdl->find($this->curUser['userid']);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '11'

    public function editForm($tweet_id)
    {
        $tweet = $this->tweetMdl->find($tweet_id);
---
SELECT *
FROM `tweets`
WHERE `tweets`.`id` = '104'

    public function delTweet($tweet_id)
    {
        $tweet = $this->tweetMdl->find($tweet_id);
---
SELECT *
FROM `tweets`
WHERE `tweets`.`id` = '106'

    public function editTweet()
    {
        $tweetData = $this->request->getPost();
        $tweet = $this->tweetMdl->find($tweetData['id']);
---
SELECT *
FROM `tweets`
WHERE `tweets`.`id` = '106'