app/Models/TweetModel.php

    public function newTweet($curUser, $post)
    {
        $tweet = new Tweet();
        $tweet->user_id     = $curUser['userid'];
        $tweet->content     = $post['content'];
        $tweet->image       = $post['image'];
        $tweet->category    = $post['category'];
        $this->save($tweet);
---
INSERT INTO `tweets` (`user_id`, `content`, `image`, `category`) VALUES ('11', 'tessss', '1688655375_64d1b08a7bffe98b2043.jpg', 'teknologi')

    public function editTweet($post)
    {
        $tweet = $this->find($post['id']);
---
SELECT *
FROM `tweets`
WHERE `tweets`.`id` = '106'